In [1]:
import pandas as pd
import numpy as np

## 과제 1: groupby

In [2]:
transactions = pd.read_csv('./data/retail/transactions.csv', parse_dates=['date'])
transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [3]:
(
    transactions
    .groupby('store_nbr')[['transactions']]
    .sum()
    .sort_values('transactions', ascending=False)
).iloc[:10]

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488

## 과제 2: groupby
Multiple Columns

In [4]:
transactions['month'] = transactions['date'].dt.month
transactions.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [5]:
(
    transactions
    .groupby(['store_nbr', 'month'])[['transactions']]
    .sum()
    .sort_values(['month', 'transactions'], ascending=[True, False])
)

                 transactions
store_nbr month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

## 과제 3: 데이터프레임 멀티인덱스

In [6]:
grouped = (
    transactions
    .groupby(['store_nbr', 'month'])
    .agg({'transactions': ['sum', 'mean']})
    .sort_values(['month', ('transactions', 'sum')], ascending=[True, False])
)
grouped.head()

                transactions
                         sum         mean
store_nbr month
44        1           628438  4246.202703
47        1           568824  3843.405405
45        1           538370  3637.635135
46        1           522763  3532.182432
3         1           463260  3151.428571

In [7]:
grouped.loc[[(3, 1)]]

                transactions
                         sum         mean
store_nbr month
3         1           463260  3151.428571

In [8]:
grouped.loc[:, [('transactions', 'mean')]]

                transactions
                        mean
store_nbr month
44        1      4246.202703
47        1      3843.405405
45        1      3637.635135
46        1      3532.182432
3         1      3151.428571
...                      ...
32        12      718.058333
21        12     1402.133333
42        12     1279.016667
29        12     1277.116667
22        12      844.166667

[641 rows x 1 columns]

In [9]:
(
    grouped
    .droplevel(0, axis=1)
    .reset_index()
)

     store_nbr  month     sum         mean
0           44      1  628438  4246.202703
1           47      1  568824  3843.405405
2           45      1  538370  3637.635135
3           46      1  522763  3532.182432
4            3      1  463260  3151.428571
..         ...    ...     ...          ...
636         32     12   86167   718.058333
637         21     12   84128  1402.133333
638         42     12   76741  1279.016667
639         29     12   76627  1277.116667
640         22     12   50650   844.166667

[641 rows x 4 columns]